{"posts":[{"title":"Sign Language gestures to Speech Gloves","text":"This glove can convert sign language gestures to actual speech. It uses 9 axis motion data (accelerometer, gyroscope and magnetometer) to estimate the orientation of the hand, along with one flex sensor on each finger to detect the bendings. The microprocessor used on the gloves then translates the data to the English language and sends it to a custom application on a mobile phone. The app then dictates the received text. This project was done as a part of a hardware hackathon held on Thapathali Campus (Institute of Engineering) and was completed in the time frame of 1 week. The signs used were arbitrary, but can be updated to use standard ones.","link":"/congenial-goggles/2019/12/09/gesture_to_speech/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/congenial-goggles/2022/09/09/hello-world/"},{"title":"Namaste Nepal","text":"NepalHi this is from Nepal and I like it to be from here as well. Cheers 🍻","link":"/congenial-goggles/2022/09/09/namaste-nepal/"},{"title":"Precision Livestock Farming","text":"Comming soon…","link":"/congenial-goggles/2022/09/09/precision_lifestock_farming/"},{"title":"Low Cost Spin Coater","text":"Spin coating is a laboratory method to generate thin and homogeneous organic films out of solutions. An excess amount of solution is placed on an ultraporous substrate that is then rotated at high speed. The liquid spreads due to centrifugal forces and a uniform liquid layer forms on the substrate. A machine used for spin coating is called a spin coater. Though vital laboratory equipment for disease diagnosis, a commercial spin coater is pretty expensive. The cheapest one costs around 150-200 dollars, which is still unaffordable for health clinics and hospitals in rural areas of Nepal. With the help of research labs at RECAST, we developed a high speed (up to 5000 RPM) speed coater prototype with variable speed which could be used for thin fluid coating of the samples. The prototype was developed at one-tenth the cost of a commercial one. Our design showed more or less comparable results to that of commercial ones.","link":"/congenial-goggles/2018/12/09/spin_coater/"},{"title":"Streetfood Vending Machine","text":"Comming soon…","link":"/congenial-goggles/2019/05/09/streetfood_vending_machine/"}],"tags":[],"categories":[{"name":"Project","slug":"Project","link":"/congenial-goggles/categories/Project/"}],"pages":[{"title":"","text":"Bio My research interest includes Robotics, Photogrammetry, SLAM. I am currently working as Research Assistant at NAAMII. I am currently working on Visual SLAM, SFM, 3D reconstruction.","link":"/congenial-goggles/index.html"},{"title":"Curriculum Vitae","text":"Work ExperienceNAAMIIResearch Assistant2020-2022Very nice work did here! EducationBachelors in Electronics and Communication engineeringDid bachelors in Electronics","link":"/congenial-goggles/cv/index.html"}]}